spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2010.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
	<application_type>APTPACQA</application_type> 									<!-- Application type - Acquiring -->
	<application_flow_id>2010</application_flow_id> 								<!-- Application flow (business process) - Banking terminals registration -->
	<application_status>APST0006</application_status> 								<!-- Application status - Ready to process -->
	<operator_id>ADMIN</operator_id> 												<!-- User name who made this application -->
	<institution_id>1001</institution_id> 											<!-- Institution identifier -->
	<agent_id>10000001</agent_id> 													<!-- Agent identifier -->
	<customer>
		<command>CMMDEXPR</command> 												<!-- Command for customer - find existing customer -->
		<customer_number>0000000000000000000697</customer_number> 					<!-- Unique customer number -->
		<contract>
			<command>CMMDEXPR</command> 											<!-- Command for contract - find existing contract -->
			<contract_number>00000000000000000000000000000736</contract_number> 	<!-- Contract number -->
			<terminal id="terminal_1">
				<command>CMMDCREX</command> 										<!-- Create new object command -->
				<terminal_number>00000002</terminal_number> 						<!-- Unique terminal number -->
				<terminal_type>TRMT0002</terminal_type> 							<!-- Terminal type - ATM -->
				<standard_id>1003</standard_id> 									<!-- Communication standard  -->
				<version_id>1002</version_id> 										<!-- Version number -->
				<terminal_template>10000017</terminal_template> 					<!-- Reference to terminal template -->
				<device_id>10000001</device_id> 									<!-- Communication device identifier -->
				<available_network>70000006</available_network>
				<available_operation>70000007</available_operation>
				<terminal_quantity>1</terminal_quantity>
			</terminal>
			<service value="70000073"> 												<!-- Service - attribute value contain service identifier which opened for terminal -->
				<service_object ref_id="terminal_1"> 								<!-- Service reference - attribute ref_id contain reference on attached object - terminal -->
					<start_date>2017-07-20</start_date> 							<!-- Service open date -->
				</service_object>
			</service>
		</contract>
	</customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
